cf_billing/DataProcessors/энргЗначениеТарифовМенеджер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>энргЗначениеТарифовМенеджер</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cf_billing/InformationRegisters/энргЗначенияТарифов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргЗначенияТарифов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСверхНорматива</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДСВнутри</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеРЭК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаПотребителей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргГруппыПотребителей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТарифнаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/DataProcessors/энргЗначениеТарифовМенеджер/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает тарифные группы текущии значения.
//
// Параметры:
//  СвойстваОтбора	-	Структура.
// 
// Возвращаемое значение:
//   Массив из СправочникСсылка.энргГруппыПотребителей.
//
Функция ТарифныеГруппыТекущийЗначений(СвойстваОтбора) Экспорт 
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжЗначениеТарифовМенеджер") = Неопределено Тогда
				Возврат Обработки["слжЗначениеТарифовМенеджер"].ТарифныеГруппыТекущийЗначений(СвойстваОтбора);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Схема  							= Неопределено;
	
	ПараметрыЗапроса 				= Новый Структура;	
	СоотвествиеПолей 				= Новый Структура;
	
	Если СвойстваОтбора.Свойство("Организация") Тогда
		СоотвествиеПолей.Вставить("Организация", "Организация");
		ПараметрыЗапроса.Вставить("Организация", СвойстваОтбора.Организация);
	КонецЕсли;
	
	Если СвойстваОтбора.Свойство("Район") Тогда
		СоотвествиеПолей.Вставить("Район", "Район");
		ПараметрыЗапроса.Вставить("Район", СвойстваОтбора.Район);
	КонецЕсли;
	
	Если СвойстваОтбора.Свойство("ГруппаПотребителей") Тогда
		СоотвествиеПолей.Вставить("ГруппаПотребителей", "ГруппаПотребителей");
		ПараметрыЗапроса.Вставить("ГруппаПотребителей", СвойстваОтбора.ГруппаПотребителей);
	КонецЕсли;
	
	Если СвойстваОтбора.Свойство("Услуга") Тогда
		СоотвествиеПолей.Вставить("Услуга", "Услуга");
		ПараметрыЗапроса.Вставить("Услуга", СвойстваОтбора.Услуга);
	КонецЕсли;
	
	Если СвойстваОтбора.Свойство("Поставщик")  Тогда
		СоотвествиеПолей.Вставить("Поставщик", "Поставщик");
		ПараметрыЗапроса.Вставить("Поставщик", СвойстваОтбора.Поставщик);
	КонецЕсли;
	
	Если СвойстваОтбора.Свойство("ТарифнаяЗона") Тогда
		СоотвествиеПолей.Вставить("ТарифнаяЗона", "ТарифнаяЗона");
		ПараметрыЗапроса.Вставить("ТарифнаяЗона", СвойстваОтбора.ТарифнаяЗона);
	КонецЕсли;

	ПараметрыВТ 					= Новый Массив;
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(СоотвествиеПолей));
	ПараметрыСхемы 					= Новый Структура("ПараметрыВТ", ПараметрыВТ);
	Если СвойстваОтбора.Свойство("Период") Тогда
		ПараметрыСхемы.Вставить("Период",энргФормированиеТекстовЗапроса.ПараметрПериодРавно("Период"));
		ПараметрыЗапроса.Вставить("Период", СвойстваОтбора.Период);
	КонецЕсли;
	
	РегистрыСведений.энргЗначенияТарифов.ЗаполнитьСхемуТарифныеГруппыТекущийЗначений(Схема,ПараметрыСхемы,"");
	  	
	РезультатЗапроса 				= энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема,ПараметрыЗапроса);
	Результат 						= РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ГруппаПотребителей");	
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "слжЗначениеТарифовМенеджер.ТарифныеГруппыТекущийЗначений";
		ПараметрыМетода 			= Новый Структура("СвойстваОтбора", СвойстваОтбора);
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, Результат, ПараметрыМетода);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
